const veryLongText =
  "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. ";
const generateLongContent = () =>
  Array.from({ length: 30 }, () => veryLongText.repeat(4));
export const baseNews = [
  {
    id: 1,
    title: "تطوير برنامج صكوك بصيغة الإجارة",
    description: `أعلنت وزارة المالية والمركز الوطني لإدارة الدين عن تطوير برنامج "صح" للصكوك الحكومية الادخارية وذلك من خلال إصدار صكوك بصيغة الإجارة.`,
    hijriDate: "08/28/1446",
    image: "/Image.png",
  },
  {
    id: 2,
    title: "الانتهاء من استقبال طلبات إصدار مارس",
    description: `أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة ...`,
    hijriDate: "09/18/1446",
    image: "/Image.png",
  },
  {
    id: 3,
    title: "إعلان تفاصيل الإصدار المحلي القادم",
    description: `أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة ...`,
    hijriDate: "09/10/1446",
    image: "/Image.png",
  },
  {
    id: 4,
    title: "نجاح طرح الإصدار المحلي لشهر فبراير",
    description: `أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة ...`,
    hijriDate: "08/30/1446",
    image: "/Image.png",
  },
  {
    id: 5,
    title: "تحديثات برنامج الدين العام",
    description: `أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة ...`,
    hijriDate: "08/15/1446",
    image: "/Image.png",
  },
  {
    id: 6,
    title: "إعلان نتائج الإصدار المحلي",
    description: `أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة ...`,
    hijriDate: "08/05/1446",
    image: "/Image.png",
  },
];

export const newsMock = Array.from({ length: 36 }, (_, index) => {
  const item = baseNews[index % baseNews.length];

  return {
    id: index + 1,
    title: item.title,
    description: item.description,
    hijriDate: `08/${((index % 28) + 1).toString().padStart(2, "0")}/1446`,
    image: "/Image.png",
    content: generateLongContent(),
  };
});
